
__author__ = 'Лещинина Е.А..'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

x = 8956
num = str(x)
while len(num) > 1:
  if num[0] > num[1]:
    num = num.replace(num[1],"")
  else:
    num = num.replace(num[0],"")
print(num)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

one = int(input('Введите первое значение: '))
two = int(input('Введите второе значение: '))
one += two
two = one - two
one = one - two
print(one)
print(two)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math
print('ax**2 + bx + c = 0:')
a = int(input('Введите значение a: '))
b = int(input('Введите значение b: '))
c = int(input('Введите значение c: '))
D = b**2 - 4*a*c
if D < 0:
    print('Корней нет')
elif D == 0:
    x = (b*(-1) + math.sqrt(D)) / 2*a
    print('x = ', x)
else:
    x1 = (b*(-1) + math.sqrt(D)) / 2*a
    x2 = (b*(-1) - math.sqrt(D)) / 2*a
    print('x1 =', x1, 'x2 =', x2)
