
__author__ = Лещинина Е.А.'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

number = int(input("Введите числовое значение: "))
new_number = str(number)
for i in new_number :
  if i <= len(new_number):
    print(i)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

one_name = input('Введите первое значение: ')
two_name = input('Введите второе значение: ')
new_one_name = one_name
one_name = two_name
two_name = new_one_name
print(one_name)
print(two_name)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age = int(input("Введите Ваш возраст: " ))
if age > 18 :
  print("Доступ разрешен")
else:
  print("Извините, пользование данным ресурсом только с 18 лет")
