# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.


# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

basket = ['apple', 'banana', 'kiwi', 'watermelon']
one = 0
for i in basket:
    one += 1
    print(one, '.', "[:>10}".format(i))

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

one = {1,2,3}
two = {3,4,5}
three = one - two
print(three)


# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

one = [1,2,3,4,5,6]
two = []
for i in one:
    if i%2 ==0:
        i = i/4
        two.append(i)
    else:
        i = i*2
        two.append(i)
print(two)
