# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами. 
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

a = [1,2,4,0]
c = [i ** 2 for i in a]
print(c)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

a = ['яблоко', 'груша', 'апельсин', 'виноград']
b = ['мандарин', 'грейпфрукт', 'апельсин', 'яблоко']
two = [i for i in a if i in b ]
print(two)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

import random
one = [random.randrange(-100,100) for _ in range(10)]
two = [i for i in one if i > 0 and i % 3 == 0 and i % 4 != 0 ]
print(one, two)